{
    "id":"bb012",
    "title":"How to learn Python",
    "Content":"Python is also a object oriented programming language used very often on the Internet by web based tools such as Google. — Preceding unsigned comment added by 203.109.86.7 (talk) 07:37, 1 March 2005 (UTC) there's a programming program called Python. —Preceding unsigned comment added by 80.96.151.245 (talk) 13:43, 28 December 2007 (UTC) There's already a link in this article to Python (programming language). Perhaps the 'programming program'you refer to is a compiler or interpreter for this. --Jwinius (talk) 15:47, 28 December 2007 (UTC) python is a open source software and easy to use Ykajal65 (talk) 11:13, 21 October 2018 (UTC) Disambiguation issues I moved Python (disambiguation) to Python and Python to Python (snake) to make the Wikipedia easier to navigate. A large number of the python links were about the language and this will reduce the average number of clicks to get around. Daniel Quinlan 09:37, Mar 8, 2005 (UTC) This sounds like a reasonable move. I think Python should redirect to Python (disambiguation) due to how common the alternative meanings are. --Karnesky 06:17, 6 February 2006 (UTC) Seems to me that most things named 'Python' are named after the snake, thus one would assume that the most predominant link should be the page on the snake, and the disambiguation link at the top should be enough to direct anyone else to where they want to go. Not that I care either way, just figured I'd be devil's advocate for a moment. -Dawson 22:31, 6 February 2006 (UTC) The snake is undisputably the primary meaning of 'Python'; all other uses flow from it. Wikipedia editors are generally very computer-literate and frequently programming-literate, and so they would often associate the word Python with the programming language. However, that's not how the general educated public sees it; few outside the programming community would ever have heard of or have any interest in the Python programming language. Wikipedia aims to be a general encyclopedia, and so we must be careful not to allow computer-related meanings to hijack the primary meanings of words. Rwxrwxrwx 20:51, 1 April 2006 (UTC) I agree with Rwxrwxrwx: 'Python' should point to Python (snake) and not to Python (disambiguation). A poll in the street will show that 99% of the population expect Python to be a snake (even most of the programming-literate population will expect it). I propose moving Python to Python (snake) and adding a link on that page to Python (disambiguation).Tos 08:53, 14 November 2007 (UTC) I agree again. Make it the default show Python (snake) and not Python (disambiguation)! Wilbot (talk) 09:59, 5 December 2007 (UTC)",
    "author":"vishal bhai",
    "slug":"how_to_learn_python"
    

}